In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r'D:\Data Science & AI class note\27th Nov\27th --  Pandas Dataframe\26th --  Pandas Dataframe\dt, time split\TASK -- convert raw data - clean data.xlsx')
df

                                          ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038 2022-04-02  dec  5:30:21

In [3]:
df['ADDR']

0    45 rd, kenith street, btm, bangalore 500038
1              45 rd,  street, hitech, Hd 500038
Name: ADDR, dtype: object

In [4]:
df[['HouseNO', 'Locality', 'City', 'PIN']] = df['ADDR'].str.extract(r'^(.*?),\s*(.*?),\s*(.*?)(?:,?\s*(\d{6}))?$')
df

,ADDR,DT,NAME,time,HouseNO,Locality,City,PIN
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038

In [5]:
df['DT']

0   2022-04-03
1   2022-04-02
Name: DT, dtype: datetime64[ns]

In [6]:
df['Year'] = df['DT'].dt.year
df['Month'] = df['DT'].dt.month
df['Day'] = df['DT'].dt.day
df

,ADDR,DT,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,"45 rd, kenith street, btm, bangalore 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,"45 rd, street, hitech, Hd 500038",2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2

In [7]:
df.columns

Index(['ADDR', 'DT', 'NAME', 'time', 'HouseNO', 'Locality', 'City', 'PIN',
       'Year', 'Month', 'Day'],
      dtype='object')

In [8]:
df = df.drop(columns = ['ADDR'])
df

,DT,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,2022-04-03,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,2022-04-02,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2

In [19]:
df = df.drop(columns=['DT'])
df

,NAME,time,HouseNO,Locality,City,PIN,Year,Month,Day
0,abc,8:30:21,45 rd,kenith street,"btm, bangalore",500038,2022,4,3
1,dec,5:30:21,45 rd,street,"hitech, Hd",500038,2022,4,2

In [21]:
df = df.drop(columns=['Locality'])
df

  NAME     time HouseNO            City     PIN  Year  Month  Day
0  abc  8:30:21   45 rd  btm, bangalore  500038  2022      4    3
1  dec  5:30:21   45 rd      hitech, Hd  500038  2022      4    2